## Staging: alarms
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                             NAME                              |
|--------|---------------------------------------------------------------|
| add    | `aws_cloudwatch_metric_alarm.UnHealthyHostCount-TargetGroup1` |
|        | `aws_cloudwatch_metric_alarm.UnHealthyHostCount-TargetGroup2` |
| delete | `aws_cloudwatch_metric_alarm.UnHealthyHostCount`              |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.UnHealthyHostCount will be destroyed
  # (because aws_cloudwatch_metric_alarm.UnHealthyHostCount is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "UnHealthyHostCount" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:ca-central-1:687401027353:alert-critical",
        ] -> null
      - alarm_description         = "ELB Health Check - UnHealthyHostCount exceed threshold." -> null
      - alarm_name                = "UnHealthyHostCount-SEV1" -> null
      - arn                       = "arn:aws:cloudwatch:ca-central-1:687401027353:alarm:UnHealthyHostCount-SEV1" -> null
      - comparison_operator       = "GreaterThanThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 1 -> null
      - id                        = "UnHealthyHostCount-SEV1" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "HTTPCode_ELB_5XX_Count" -> null
      - namespace                 = "AWS/ApplicationELB" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "SampleCount" -> null
      - tags                      = {} -> null
      - tags_all                  = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - threshold                 = 1 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

  # aws_cloudwatch_metric_alarm.UnHealthyHostCount-TargetGroup1 will be created
  + resource "aws_cloudwatch_metric_alarm" "UnHealthyHostCount-TargetGroup1" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:687401027353:alert-critical",
        ]
      + alarm_description                     = "ELB Health Check - UnHealthyHostCount exceed threshold for TargetGroup1."
      + alarm_name                            = "UnHealthyHostCount-TargetGroup1-SEV1"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "LoadBalancer" = "app/form-viewer/5e6bc2d9ab810b68"
          + "TargetGroup"  = "arn:aws:elasticloadbalancing:ca-central-1:687401027353:targetgroup/form-viewer/decb39cad732d3d4"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "UnHealthyHostCount"
      + namespace                             = "AWS/ApplicationELB"
      + period                                = 60
      + statistic                             = "SampleCount"
      + tags_all                              = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.UnHealthyHostCount-TargetGroup2 will be created
  + resource "aws_cloudwatch_metric_alarm" "UnHealthyHostCount-TargetGroup2" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:687401027353:alert-critical",
        ]
      + alarm_description                     = "ELB Health Check - UnHealthyHostCount exceed threshold for TargetGroup2."
      + alarm_name                            = "UnHealthyHostCount-TargetGroup2-SEV1"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "LoadBalancer" = "app/form-viewer/5e6bc2d9ab810b68"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "UnHealthyHostCount"
      + namespace                             = "AWS/ApplicationELB"
      + period                                = 60
      + statistic                             = "SampleCount"
      + tags_all                              = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.codedeploy_sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notify_slack"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ELB_5xx_error_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.UnHealthyHostCount-TargetGroup1"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.UnHealthyHostCount-TargetGroup2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.audit_log_dead_letter_queue_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.cognito_login_outside_canada_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.cognito_signin_exceeded"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ddos_detected_forms_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ddos_detected_route53_warn[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.forms_cpu_utilization_high_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.forms_memory_utilization_high_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.reliability_dead_letter_queue_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.response_time_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.route53_ddos[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.twoFa_verification_exceeded"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.vault_data_integrity_check_lambda_iterator_age"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.notify_slack_lambda"]
WARN - plan.json -...
```

</details>
